src/CFD/ConvergenceStudy-luke/z-study/pipe_validation_z_10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       16780;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       17280;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       17380;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       17780;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       17900;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1200;
        startFace       18020;
    }
)

// ************************************************************************* //
